---
type: FailureDefinitionAccessor
namespace: Autodesk.Revit.DB
version: 2024
members: 11
tags: [revit-api, class]
---

# FailureDefinitionAccessor

`Autodesk.Revit.DB.FailureDefinitionAccessor` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetApplicableResolutionTypes | 2011 | `public IList < FailureResolutionType > GetApplicableResolutionTypes ()` |
| Method | GetDefaultResolutionType | 2011 | `public FailureResolutionType GetDefaultResolutionType ()` |
| Method | GetDescriptionText | 2011 | `public string GetDescriptionText ()` |
| Method | GetId | 2011 | `public FailureDefinitionId GetId ()` |
| Method | GetResolutionCaption | 2011 | `public string GetResolutionCaption ( FailureResolutionType type )` |
| Method | GetSeverity | 2011 | `public FailureSeverity GetSeverity ()` |
| Method | HasResolutions | 2011 | `public bool HasResolutions ()` |
| Method | IsResolutionApplicable | 2011 | `public bool IsResolutionApplicable ( FailureResolutionType type )` |
| Method | SetDefaultResolutionType | 2011 | `public void SetDefaultResolutionType ( FailureResolutionType type )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |